tap "buo/cask-upgrade"
tap "esolitos/ipa"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "planetlabs/tap"
tap "r-lib/rig"
tap "romkatv/powerlevel10k"
tap "teamookla/speedtest"
tap "xpipe-io/tap"
brew "actionlint"
brew "libpng"
brew "sqlite", link: true
brew "awscli"
brew "bash-completion"
brew "btop"
brew "caddy"
brew "ccat"
brew "checkbashisms"
brew "codex"
brew "commitizen"
brew "csvkit"
brew "dive"
brew "docker", link: false
brew "doctl"
brew "duckdb"
brew "eza"
brew "ffmpeg"
brew "gcc"
brew "gnupg"
brew "pkgconf"
brew "hdf5"
brew "proj"
brew "netcdf"
brew "openblas"
brew "gdal"
brew "geckodriver"
brew "gh"
brew "ghostscript"
brew "gifsicle"
brew "gist"
brew "git"
brew "git-delta"
brew "gitleaks"
brew "go"
brew "hadolint"
brew "htop"
brew "imagemagick"
brew "jq"
brew "suite-sparse"
brew "julia"
brew "lapack"
brew "lftp"
brew "llvm@17"
brew "mactop"
brew "node"
brew "markdownlint-cli"
brew "openjdk"
brew "maven"
brew "mercurial"
brew "mermaid-cli", link: false
brew "minify"
brew "mysql"
brew "neovim"
brew "openjdk@11"
brew "pandoc"
brew "parquet-cli"
brew "pgloader"
brew "pinentry-mac"
brew "postgis"
brew "postgresql@14"
brew "postgresql@16"
brew "powerlevel10k"
brew "pre-commit"
brew "pure"
brew "pv"
brew "pyqt@5"
brew "python@3.10"
brew "python-tk@3.10"
brew "python-tk@3.11"
brew "python-tk@3.12"
brew "python-tk@3.13"
brew "python@3.9"
brew "python-tk@3.9"
brew "qpdf"
brew "qsv"
brew "redis"
brew "rich-cli"
brew "rsync"
brew "ruby"
brew "rustup"
brew "sniffnet"
brew "socat"
brew "sqlfluff"
brew "subversion"
brew "tealdeer"
brew "telnet"
brew "tmux"
brew "tree"
brew "typos-cli"
brew "uv"
brew "wget"
brew "xmlto"
brew "yaml2json"
brew "yamllint"
brew "zoxide"
brew "esolitos/ipa/sshpass"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "planetlabs/tap/gpq"
brew "teamookla/speedtest/speedtest"
cask "1password"
cask "1password-cli"
cask "alt-tab"
cask "amazon-workspaces"
cask "authy"
cask "azure-data-studio"
cask "basictex"
cask "caffeine"
cask "calibre"
cask "chatgpt"
cask "chromedriver"
cask "claude"
cask "crystalfetch"
cask "cursor"
cask "cyberduck"
cask "dbeaver-community"
cask "devdocs"
cask "docker-desktop"
cask "dotnet-runtime"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "gitbutler"
cask "google-chrome"
cask "google-earth-pro"
cask "inkscape"
cask "insomnia"
cask "iterm2"
cask "jordanbaird-ice"
cask "libreoffice"
cask "malwarebytes"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "netnewswire"
cask "obsidian"
cask "orange"
cask "panoply"
cask "positron"
cask "postman"
cask "protonvpn"
cask "pycharm-ce"
cask "qgis"
cask "quarto"
cask "raycast"
cask "rectangle"
cask "rig"
cask "rustdesk"
cask "stats"
cask "teamviewer"
cask "tunnelblick"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "wkhtmltopdf"
cask "xquartz"
cask "zoom"
cask "zotero"
vscode "aykutsarac.jsoncrack-vscode"
vscode "batisteo.vscode-django"
vscode "bibhasdn.django-html"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "cameron.vscode-pytest"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "grapecity.gc-excelviewer"
vscode "hediet.vscode-drawio"
vscode "helgardrichard.helium-icon-theme"
vscode "james-yu.latex-workshop"
vscode "jprestidge.theme-material-theme"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "njpwerner.autodocstring"
vscode "openai.chatgpt"
vscode "pamaron.pytest-runner"
vscode "pkief.material-icon-theme"
vscode "quarto.quarto"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "reditorsupport.r-syntax"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "samuelcolvin.jinjahtml"
vscode "shardulm94.trailing-spaces"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "teamsdevapp.ms-teams-vscode-extension"
vscode "the-compiler.python-tox"
vscode "tomoyukim.vscode-mermaid-editor"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "yzhang.markdown-all-in-one"
vscode "zignd.html-css-class-completion"
