batisteo.vscode-django
bierner.github-markdown-preview
bierner.markdown-checkbox
bierner.markdown-emoji
bierner.markdown-footnotes
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
bierner.markdown-yaml-preamble
bpruitt-goddard.mermaid-markdown-syntax-highlighting
DavidAnson.vscode-markdownlint
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
eamodio.gitlens
ecmel.vscode-html-css
esbenp.prettier-vscode
formulahendry.auto-rename-tag
formulahendry.code-runner
KevinRose.vsc-python-indent
ms-azuretools.vscode-docker
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
njpwerner.autodocstring
PKief.material-icon-theme
quarto.quarto
quicktype.quicktype
REditorSupport.r
ritwickdey.LiveServer
streetsidesoftware.code-spell-checker
sumneko.lua
tomoyukim.vscode-mermaid-editor
VisualStudioExptTeam.intellicode-api-usage-examples
VisualStudioExptTeam.vscodeintellicode
wholroyd.jinja
