tap "buo/cask-upgrade"
tap "esolitos/ipa"
tap "homebrew/bundle"
tap "homebrew/services"
tap "romkatv/powerlevel10k"
tap "teamookla/speedtest"
brew "actionlint"
brew "gcc"
brew "btop"
brew "caddy"
brew "ccat"
brew "csvkit"
brew "doctl"
brew "duckdb"
brew "exa"
brew "ffmpeg"
brew "hdf5"
brew "proj"
brew "xmlto"
brew "netcdf"
brew "gdal"
brew "gh"
brew "gifsicle"
brew "gist"
brew "git"
brew "gitleaks"
brew "gnupg"
brew "go"
brew "hadolint"
brew "htop"
brew "imagemagick"
brew "jq"
brew "julia"
brew "node"
brew "markdownlint-cli"
brew "mercurial"
brew "mysql"
brew "openjdk"
brew "openjdk@11"
brew "pandoc"
brew "parquet-cli"
brew "pgloader"
brew "pinentry-mac"
brew "postgresql@14", restart_service: true
brew "postgis"
brew "powerlevel10k"
brew "pre-commit"
brew "pyqt@5"
brew "python-tk@3.11"
brew "python@3.10"
brew "qsv"
brew "rich-cli"
brew "rsync"
brew "ruby"
brew "rustup-init"
brew "sqlfluff"
brew "tldr"
brew "tree"
brew "wget"
brew "yamllint"
brew "esolitos/ipa/sshpass"
brew "teamookla/speedtest/speedtest"
cask "1password"
cask "1password-cli"
cask "adobe-acrobat-pro"
cask "alfred"
cask "alt-tab"
cask "authy"
cask "azure-data-studio"
cask "bartender"
cask "basictex"
cask "caffeine"
cask "calibre"
cask "cleanmymac"
cask "dbeaver-community"
cask "devdocs"
cask "docker"
cask "doll"
cask "firefox"
cask "google-earth-pro"
cask "inkscape"
cask "iterm2"
cask "itsycal"
cask "malwarebytes"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-remote-desktop"
cask "microsoft-teams"
cask "microsoft-word"
cask "netnewswire"
cask "obsidian"
cask "orange"
cask "panoply"
cask "pgadmin4"
cask "postman"
cask "qgis"
cask "quarto"
cask "raycast"
cask "rectangle"
cask "stats"
cask "teamviewer"
cask "tunnelblick"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
cask "zotero"
vscode "Anan.devdocstab"
vscode "batisteo.vscode-django"
vscode "bibhasdn.django-html"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "charliermarsh.ruff"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deibit.devdocs"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "hediet.vscode-drawio"
vscode "James-Yu.latex-workshop"
vscode "KevinRose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "mtxr.sqltools-driver-sqlite"
vscode "njpwerner.autodocstring"
vscode "PKief.material-icon-theme"
vscode "quarto.quarto"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "REditorSupport.r"
vscode "ritwickdey.LiveServer"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "tomoyukim.vscode-mermaid-editor"
vscode "usernamehw.errorlens"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "wholroyd.jinja"
vscode "yzhang.markdown-all-in-one"
