tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "romkatv/powerlevel10k"
brew "actionlint"
brew "btop"
brew "ccat"
brew "csvkit"
brew "exa"
brew "ffmpeg"
brew "hdf5"
brew "proj"
brew "xmlto"
brew "netcdf"
brew "gdal"
brew "gh"
brew "gifsicle"
brew "gist"
brew "git"
brew "gitleaks"
brew "gnupg"
brew "go"
brew "hadolint"
brew "htop"
brew "julia"
brew "node"
brew "markdownlint-cli"
brew "mysql"
brew "openjdk"
brew "pandoc"
brew "pgloader"
brew "pinentry-mac"
brew "postgresql@14", restart_service: true
brew "postgis"
brew "pre-commit"
brew "pyqt@5"
brew "python@3.10"
brew "rsync"
brew "ruby"
brew "rust"
brew "speedtest-cli"
brew "sqlfluff"
brew "tldr"
brew "tree"
brew "wget"
brew "yamllint"
brew "romkatv/powerlevel10k/powerlevel10k"
cask "1password"
cask "1password-cli"
cask "adobe-acrobat-pro"
cask "alfred"
cask "alt-tab"
cask "authy"
cask "azure-data-studio"
cask "bartender"
cask "basictex"
cask "caffeine"
cask "calibre"
cask "cleanmymac"
cask "dbeaver-community"
cask "docker"
cask "doll"
cask "firefox"
cask "google-earth-pro"
cask "inkscape"
cask "iterm2"
cask "itsycal"
cask "maccy"
cask "malwarebytes"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-remote-desktop"
cask "microsoft-teams"
cask "microsoft-word"
cask "netnewswire"
cask "nordvpn"
cask "obsidian"
cask "panoply"
cask "pgadmin4"
cask "qgis"
cask "quarto"
cask "raycast"
cask "rectangle"
cask "stats"
cask "steam"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
